app/controllers/chapters_controller.rb

  def create
    @chapter = user_log.chapters.build(chapter_params)
    authorize @chapter
    @chapter.save ? (render json: @chapter, status: 201) : (render json: @chapter.errors, status: 400)
---
INSERT INTO "chapters" ("title", "description", "goal", "log_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Bulk #1"], ["description", "My Bulk!"], ["goal", 0.4], ["log_id", 1], ["created_at", "2016-07-11 20:17:44.681756"], ["updated_at", "2016-07-11 20:17:44.681756"]]

  def update
    @chapter.update(completed_at: Time.zone.now)
---
UPDATE "chapters" SET "completed_at" = ?, "updated_at" = ? WHERE "chapters"."id" = ?  [["completed_at", "2016-07-12"], ["updated_at", "2016-07-12 23:00:21.277517"], ["id", 11]]

  def set_and_authorize_chapter!
    @chapter = Chapter.find(params[:id])
---
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = ?  ORDER BY "chapters"."created_at" DESC LIMIT 1  [["id", 11]]