app/controllers/entries_controller.rb

INSERT INTO "entries" ("chapter_id", "notes", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["chapter_id", 11], ["notes", "test"], ["day", "2016-07-18"], ["created_at", "2016-07-18 23:11:20.274335"], ["updated_at", "2016-07-18 23:11:20.274335"]]
---
  def create
    @entry = Entry.new(entry_params)
    authorize @entry
    @entry.save ? (render json: @entry, status: 201) : (render json: @entry.errors, status: 400)