app/controllers/foods_controller.rb

  def create
    @food = Food.new(food_params)
    authorize @food
    @food.save ? (render json: @food, status: 201) : (render json: @food.errors, status: 400)
---
INSERT INTO "foods" ("name", "protein", "carbs", "fats", "calories", "entry_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "Burger"], ["protein", 30], ["carbs", 30], ["fats", 30], ["calories", 600], ["entry_id", 4], ["created_at", "2016-07-20 20:59:22.237183"], ["updated_at", "2016-07-20 20:59:22.237183"]]

  def destroy
    @food = Food.find(params[:id])
    authorize @food
    @food.destroy
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 11]]